Revit 2026 API

# TextRangeStart Property

---

The start index of a range within the FormattedText.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Start { get; set; }
```
```vb
Public Property Start As Integer
	Get
	Set
```
```cpp
public:
property int Start {
	int get ();
	void set (int value);
}
```
```fsharp
member Start : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for start is negative. |

#### Reference

TextRange Class

Autodesk.Revit.DB Namespace